app/controllers/articles_controller.rb

  def show
    @article = Article.find_by(slug: params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`slug` = 'test-gtg' LIMIT 1

  def edit
    @article = Article.find_by(slug: params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`slug` = 'test-gtg' LIMIT 1

  def update
    @article = Article.find_by(slug: params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`slug` = 'test-gtg' LIMIT 1