app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `status`, `slug`) VALUES ('tesT gtg', 'werhtukyilkjhg', '2021-09-29 15:35:17.759193', '2021-09-29 15:35:17.759193', 'public', 'test-gtg')
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
UPDATE `articles` SET `articles`.`title` = 'it works!', `articles`.`updated_at` = '2021-09-29 15:59:30.684302' WHERE `articles`.`id` = 4
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 1
---
  def destroy
    @article = Article.find(params[:id])
    @article.destroy