app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `article_id`, `created_at`, `updated_at`, `status`) VALUES ('?', '0987654321', 3, '2021-09-29 11:11:02.672840', '2021-09-29 11:11:02.672840', 'public')